> Did you test what `plan` looks like for a team that was created before this change was introduced? I wonder if we should ignore the diff if UID was not set and then gets set for the first time, as this is not something that we expect users to do anything about, so showing a diff might be confusing.


# existing teams

nothing changes for existing teams

# new created teams for the plan will look like:

## previously
  // grafana_team.test-2 will be created
  + resource "grafana_team" "test-2" {
      + id      = (known after apply)
      + name    = "Test team 2"
      + team_id = (known after apply)
    }

## new introduce change
  // grafana_team.test-2 will be created
  + resource "grafana_team" "test-2" {
      + id       = (known after apply)
      + name     = "Test team 2"
      + team_id  = (known after apply)
      + team_uid = (known after apply)
    }